Revit 2026 API
SteelElementProperties.GetSteelElementProperties Method
 Get SteelElementProperties for the input element if they exist.
Namespace: Autodesk.Revit.DB.Steel
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static SteelElementProperties GetSteelElementProperties(
	Element pElement
)
Public Shared Function GetSteelElementProperties (
	pElement As Element
) As SteelElementProperties
public:
static SteelElementProperties^ GetSteelElementProperties(
	Element^ pElement
)
static member GetSteelElementProperties :
        pElement : Element -> SteelElementProperties
Parameters
pElement Element
 The element from which we try to obtain SteelElementProperties.
Return Value
SteelElementProperties
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the input element doesn't have steel informations than it retuns null.
See Also
Reference
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace